Tekla Open API Reference for Tekla Structures 2025
GADrawing Constructor (String)
 Instantiates a new GA drawing with the given attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GADrawing(
	string AttributeFile
)
Public Sub New (
	AttributeFile As String
)
Parameters
AttributeFile
Type: System.String
The name of the attribute file.
See Also
Reference
GADrawing Class
GADrawing Overload
Tekla.Structures.Drawing Namespace